src/main/webapp/WEB-INF/soap/delete.request.soap

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:del="http://wesleydekraker.nl/windmillservice/deleterequest" xmlns:typ="http://wesleydekraker.nl/windmillservice/types">
   <soapenv:Header/>
   <soapenv:Body>
      <del:deleteRequest>
         <typ:id>1</typ:id>
      </del:deleteRequest>
   </soapenv:Body>
</soapenv:Envelope>